In [1]:
%load_ext sql
import sqlite3
import pandas as pd

In [2]:
%sql sqlite:///CourseData.db
conn = sqlite3.connect('CourseData.db')

# 4. CourseData Database Integrity Checks

## A. How many seats remain for Professor Bloch's Spring 2018 classes?

In [7]:
%%sql
SELECT DISTINCT COURSE_OFFERINGS.CRN, SECTION, CAPACITY, REMAINING, INSTRUCTOR_NAME, COURSE_OFFERINGS.TERM
FROM COURSE_OFFERINGS
    JOIN INSTRUCTORS ON (COURSE_OFFERINGS.PRIMARY_INSTRUCTOR_ID = INSTRUCTORS.INSTRUCTOR_ID)
    JOIN COURSE_MEETINGS USING (COURSE_OFFERING_ID)
WHERE INSTRUCTOR_NAME LIKE '%Bloch' AND COURSE_OFFERINGS.TERM = 'Spring2018'
ORDER BY REMAINING DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(34137, 1, 24, 2, 'Rebecca I.  Bloch', 'Spring2018'),
 (34085, 1, 25, -2, 'Rebecca I.  Bloch', 'Spring2018'),
 (34164, 2, 25, -4, 'Rebecca I.  Bloch', 'Spring2018')]

## B. What is the actual enrollment for a class compared to capacity for courses in Fall 2018?

In [20]:
%%sql
SELECT DISTINCT COURSE_OFFERINGS.CRN, SECTION, CAPACITY, ACTUAL, COURSE_MEETINGS.TERM
FROM COURSE_OFFERINGS
    JOIN COURSE_MEETINGS USING (CRN)
WHERE COURSE_MEETINGS.TERM = 'Fall2018'
ORDER BY ACTUAL DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(74173, 1, 64, 65, 'Fall2018'),
 (74362, 1, 60, 62, 'Fall2018'),
 (74754, '01C', 0, 60, 'Fall2018'),
 (75868, 'A-C', 0, 58, 'Fall2018'),
 (75823, 2, 64, 58, 'Fall2018'),
 (75304, 4, 60, 57, 'Fall2018'),
 (74598, 1, 60, 57, 'Fall2018'),
 (74839, '02C', 0, 56, 'Fall2018'),
 (75964, '03C', 0, 56, 'Fall2018'),
 (75814, 4, 60, 56, 'Fall2018')]

## C. Which classrooms are the most utilized?

In [21]:
%%sql
SELECT DISTINCT COURSE_MEETINGS.LOCATION_ID, ROOM_ID, COUNT(COURSE_OFFERING_ID)
FROM COURSE_MEETINGS
    LEFT JOIN LOCATIONS USING (LOCATION_ID)
GROUP BY COURSE_MEETINGS.LOCATION_ID, ROOM_ID
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'BCC 200', 26),
 (2, 'BD ', 11),
 (3, 'BH ', 381),
 (4, 'BH BY ARR', 15),
 (5, 'BLM 112', 13),
 (6, 'BLM LL105', 1339),
 (7, 'BNW 124', 2941),
 (8, 'BNW 127', 3966),
 (9, 'BNW 128', 731),
 (10, 'BNW 129B', 1301)]

## D. How many classes has each professor taught?

In [27]:

%%sql
SELECT COURSE_OFFERINGS.TERM, INSTRUCTOR_ID, INSTRUCTOR_NAME,COUNT(CRN),COUNT(COURSE_ID), COUNT(COURSE_OFFERINGS.CATALOG_ID)
FROM COURSE_OFFERINGS
    JOIN COURSES USING (CATALOG_ID)
    JOIN INSTRUCTORS ON COURSE_OFFERINGS.PRIMARY_INSTRUCTOR_ID = INSTRUCTORS.INSTRUCTOR_ID
GROUP BY INSTRUCTOR_ID
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Fall2014', 1, 'Michael P.  Coyne', 56, 56, 56),
 ('Fall2014', 2, 'Rebecca I.  Bloch', 52, 52, 52),
 ('Fall2014', 3, 'Paul   Caster', 56, 56, 56),
 ('Fall2014', 4, 'Jo Ann   Drusbosky', 70, 70, 70),
 ('Fall2014', 5, 'Arleen N.  Kardos', 40, 40, 40),
 ('Fall2014', 6, 'Scott M  Brenner', 54, 54, 54),
 ('Fall2014', 7, 'Kevin C.  Cassidy', 8, 8, 8),
 ('Spring2017', 8, 'Bruce   Bradford', 62, 62, 62),
 ('Fall2014', 9, 'Milo W.  Peck', 94, 94, 94),
 ('Spring2015', 10, 'Stephen E.  Yost', 42, 42, 42)]

## E. How many courses are in each program?

In [44]:
%%sql
SELECT DISTINCT PROGRAMS.PROGRAM_ID, PROGRAM_NAME,COUNT(CATALOG_ID)
FROM COURSES
    JOIN PROGRAMS USING (PROGRAM_ID)
GROUP BY PROGRAMS.PROGRAM_ID, PROGRAM_NAME
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'Accounting', 68),
 (2, 'Applied Ethics', 64),
 (3, 'Art History', 72),
 (4, 'Asian Studies', 4),
 (5, 'Arabic', 16),
 (6, 'American Studies', 90),
 (7, 'Anthropology', 40),
 (8, 'Business', 20),
 (9, 'Bioengineering', 14),
 (10, 'Biology', 190)]